gdgly/MoteR_dsPIC33EP32MC204-verx.xx/MotorControl/SpeedController/SpeedController.c
/*********************************************************************************
* FileName: SpeedController.c
* Description:
* This source file contains the definition of all the functions for SpeedController.
* It implements all the functions required by speed controller.
**********************************************************************************/

/****************************************************************************
 * Copyright 2014 Bunka Shutters.
 * This program is the property of the Bunka Shutters
 * Company, Inc.and it shall not be reproduced, distributed or used
 * without permission of an authorized company official.This is an
 * unpublished work subject to Trade Secret and Copyright
 * protection.
*****************************************************************************/

/****************************************************************************
 *  Modification History
 *  
 *  Date                  Name          Comments 
 *  09/04/2014            iGate          Initial Creation                                                               
*****************************************************************************/
#include <p33Exxxx.h>
#include "SpeedController.h"
#include "./MotorControl/PIController/pi.h"
#include "./MotorControl/Algorithm/svm.h"
#include "./Common/UserDefinition/Userdef.h"
#include "./Common/Extern/Extern.h"
#include "./Common/Delay/Delay.h"
#include "./Application/RampGenerator/RampGenerator.h"
#include "./Drivers/GPIO/GPIO.h"

//	Macro to enable feature of motor cable fault - Dec 2015
//#define ENABLE_MOTOR_CABLE_FAULT

#define PERIOD_FILTER_CONST 2000//2500//2000 /* the smaller the value, the higher the filter
                                    //and the delay introduced */
/* In the sinewave generation algorithm we need an offset to be added to the */
/* pointer when energizing the motor */
//#define PHASE_OFFSET_CW 1800 //measured offset is 100*(360/65536) = 5.4 degrees.
//#define PHASE_OFFSET_CCW 9840 //182 counts for 1 degree

#ifdef USE_PHASE_INC_AND_CORRECTION
#define PHASE_OFFSET_CW_750W  364//8500//2002     //1274 //measured offset is 1274*(360/65536) = 7 degrees.
#define PHASE_OFFSET_CCW_750W 10558//10740     //9828//9646//53 degrees

//#define PHASE_OFFSET_CW_1500W 9828//6916//6006//5460//5096//4004//1820//728//364//1274 //measured offset is 1274*(360/65536) = 7 degrees.
//#define PHASE_OFFSET_CCW_1500W 364 //5096//5460//6006//6370//6916//7280//8372//8736//9464//9828//9100//53 degrees

//#define PHASE_OFFSET_CW_def_1500W 6916//2366//6916//364 //measured offset is 364*(360/65536) = 2 degrees.
//#define PHASE_OFFSET_CCW_def_1500W 5460//5096//8008//9828 // Fukui result - 54 degree 10192
//#define PHASE_OFFSET_CW_MAX_1500W 10556
//#define PHASE_OFFSET_CCW_MAX_1500W 364 //5096     //2016/08/17 Down Moving after Over Current by IME
//#define PHASE_OFFSET_INC_STEP_1500W 10
//#define PHASE_OFFSET_DEC_STEP_1500W 20

#define PHASE_OFFSET_CW_def_1500W 2366//2366//6916//364 //measured offset is 364*(360/65536) = 2 degrees.
#define PHASE_OFFSET_CCW_def_1500W 9828//5096//8008//9828 // Fukui result - 54 degree 10192
#define PHASE_OFFSET_CW_MAX_1500W 6916
#define PHASE_OFFSET_CCW_MAX_1500W 5096 //9828 //5096     //2016/08/17 Down Moving after Over Current by IME
#define PHASE_OFFSET_INC_STEP_1500W 1
#define PHASE_OFFSET_DEC_STEP_1500W 20

#else
#define PHASE_OFFSET_CW 10000 
#define PHASE_OFFSET_CCW 0
#endif
/*******************************************************************************/ 
/* These Phase values represent the base Phase value of the sinewave for each  */
/* one of the sectors (each sector is a translation of the hall effect sensors */
/* reading */
/****************************************************************************/
#define PHASE_ZERO 	0
#define PHASE_ONE	((PHASE_ZERO + 65536/6) % 65536)
#define PHASE_TWO	((PHASE_ONE + 65536/6) % 65536)
#define PHASE_THREE	((PHASE_TWO + 65536/6) % 65536)
#define PHASE_FOUR	((PHASE_THREE + 65536/6) % 65536)
#define PHASE_FIVE	((PHASE_FOUR + 65536/6) % 65536)

#define INVALID     -1
#define CNT_10MS    10      /* Used as a timeout with no hall effect sensors */
                            /* transitions and Forcing steps according to the */
                            /* actual position of the motor */

#define MS_500T 1000//300//500          /* after this time has elapsed, the motor is    */
                            /* consider stalled and it's stopped    */

/* PI parameters */
//#define P_SPEED_PI_CW 10000//12000
//#define I_SPEED_PI_CW 1000//9000
//#define P_SPEED_PI_CCW 10000//9000//15000//9000
//#define I_SPEED_PI_CCW 500//300//800//1000//2000//6000
#define P_SPEED_PI_CW_750W 10000//6000//7000//10000//13106//20000//15000//5000
#define I_SPEED_PI_CW_750W 700//1500//1800//2000//9830//10000//8000//4000
#define P_SPEED_PI_CCW_750W 10000//22000
#define I_SPEED_PI_CCW_750W 700//100
#define P_SPEED_PI_CW_1500W 10000//6000//7000//10000//13106//20000//15000//5000
#define I_SPEED_PI_CW_1500W 1000//1500//1800//2000//9830//10000//8000//4000
#define P_SPEED_PI_CCW_1500W 10000//22000
#define I_SPEED_PI_CCW_1500W 500//100
#define C_SPEED_PI 0x7FFF 
#define MAX_SPEED_PI    31128   //95% of max value ie 32767

/* In the sinewave generation algorithm we need an offset to be added to the */
/* pointer when energizing the motor in CCW. This is done to compensate an   */
/* asymetry of the sinewave */
SHORT phaseOffsetCW =PHASE_OFFSET_CW_def_1500W;
SHORT phaseOffsetCCW =PHASE_OFFSET_CCW_def_1500W;


#define SET_TARGET_SPEED_750W_CW    1000//1800//1900 //Required final speed
#define SET_TARGET_SPEED_750W_CCW   1000//1800
#define SPEED_INC_STP_750W       100
#define SET_TARGET_SPEED_1500W    2500//1900//1900 //Required final speed
#define SPEED_INC_STP_1500W       50
#define SPD_INC_INTERVAL    100

#define SPD_CAL_FOR_PHASEADVANCE    (int)((float)((((float)(measuredSpeed / 60) * NO_POLEPAIRS_750W) * 360) / 1000))
#define MAX_PH_ADV_DEG      1
#define MAX_PH_ADV 		(int)(((float)MAX_PH_ADV_DEG / 360.0) * 65536.0)
UINT16 PhaseAdvance;


/* Period filter for speed measurement */
DWORD periodFilter;
UINT16	cnt_motor_stop = 0;

/* Constants used for properly energizing the motor depending on the rotor's position */
CONST SHORT phaseValues[SECTOR_END] =
{PHASE_ZERO, PHASE_ONE, PHASE_TWO, PHASE_THREE, PHASE_FOUR, PHASE_FIVE}; 

/* PI configuration structure */
tPIParm speedPIparms;

