gdgly/MoteR_dsPIC33EP32MC204-verx.xx/MotorControl/SpeedController/SpeedController.c
/* This variable is incremented by the PWM interrupt in order to generate a proper sinewave. Its value */
/* is incremented by a value of PhaseInc, which represents the frequency of the generated sinewave */
WORD phase;
WORD phaseCopy;
SHORT phaseIncFlg;

/* This variable holds the hall sensor input readings */
WORD hallValue;

/* This variables holds present sector value, which is the rotor position */
SHORT sector;

/* This variable holds the last sector value. This is critical to filter slow slew rate on the Hall */
/* effect sensors hardware */
WORD lastSector;

/* This array translates the hall state value read from the digital I/O to the */
/* proper sector.  Hall values of 0 or 7 represent illegal values and therefore */
/* return -1. */

//#if (MOTOR_TYPE == PICOMO_MOTOR)
//    CHAR sectorTable[] = {INVALID,SECTOR_ZERO,SECTOR_FOUR,SECTOR_FIVE,SECTOR_TWO,SECTOR_ONE,SECTOR_THREE,INVALID};
//#elif (MOTOR_TYPE == NEW_MOTOR_1)
//    CHAR sectorTable[] = {INVALID,SECTOR_THREE,SECTOR_FIVE,SECTOR_FOUR,SECTOR_ONE,SECTOR_TWO,SECTOR_ZERO,INVALID};
//#elif (MOTOR_TYPE == NEW_MOTOR_2)
CHAR sectorTable[8];
//#else
//    #error Motor sectors not defined
//#endif
  
/* Variables containing the Period of half an electrical cycle, which is an */
/* interrupt each edge of one of the hall sensor input */
DWORD period;
DWORD phaseIncPerSec = 0;

/* Used as a temporal variable to perform a fractional divide operation in */
/* assembly */
SHORT measuredSpeed;  /* Actual speed for the PID */
SHORT measuredSpeed_bak;
BOOL Motor_ERR_overcurrent_or_igbtOverTemp;
SHORT refSpeed = 200;	    /* Desired speeds for the PID */ 

/* Output of PID controller, use its sign for required direction */
SHORT controlOutput;
SHORT ctrlOpPercent;

/* Filter used for speed measurement */
WORD periodFilterConstant;
DWORD periodStateVar;	

//SHORT speedError;

//Observed hall counts for one hall sensor (IC2) is 155, 148, 151
SHORT hallCounts = 0;

/* Variable used by inbuilt division function */
UINT tmpQu = 0;
UINT tmpRe = 0;

SHORT hall2Triggered;
DWORD totalTimePeriod;

SHORT phaseInc;

WORD MotorRunCount = 0;
WORD MotorCycleCount = 0;
BYTE MotorStartComplete = 0;
BYTE MotorDecActive = 0;


/* This function is used to measure actual running speed of motor */
VOID measureActualSpeed(VOID);

/* This function is speed PI controller */
VOID speedControl(VOID);

/* This function initializes all the variables used by speed controller */
VOID initSpeedControllerVariables(VOID);


/******************************************************************************
 * _T1Interrupt
 *
 * The _T1Interrupt calculates actual speed of motor and runs speed PI controller.
 * It checks for motor stalled and calls force commutation to run motor. If the 
 * motor is stalled for more than 1 sec then stop all services to run the motor.
 *
 * PARAMETER REQ: none
 *
 * RETURNS: none
 *
 * ERRNO: none
 ********************************************************************************/  
void __attribute__((interrupt, no_auto_psv)) _T1Interrupt (void)
{
//    PRIVATE WORD cnt10ms = 0;
    
    IFS0bits.T1IF = 0;
    
    static WORD cnt1000ms = 0;
    //if(!MotorStartComplete)
    //{
        if(++cnt1000ms >= SPD_INC_INTERVAL)
        {
            cnt1000ms = 0;
            if(MotorDecActive == 0)
            {
                if(PreMotorType == MOTOR_750W)
                {
                    if(requiredDirection == CW)
                    {
                        if(refSpeed < SET_TARGET_SPEED_750W_CW)
                        {            
                            refSpeed += SPEED_INC_STP_750W;
                            if(refSpeed >= SET_TARGET_SPEED_750W_CW)
                            {
                                refSpeed = SET_TARGET_SPEED_750W_CW;
                                //MotorStartComplete = 1;
                            }
                        }
                    }
                    else
                    {
                        if(refSpeed < SET_TARGET_SPEED_750W_CCW)
                        {            
                            refSpeed += SPEED_INC_STP_750W;
                            if(refSpeed >= SET_TARGET_SPEED_750W_CCW)
                            {
                                refSpeed = SET_TARGET_SPEED_750W_CCW;
                                //MotorStartComplete = 1;
                            }
                        }
                    }
                }
                else if(PreMotorType == MOTOR_1500W)
                {
                    if(refSpeed < SET_TARGET_SPEED_1500W)
                    {            
                        refSpeed += SPEED_INC_STP_1500W;
                        if(refSpeed >= SET_TARGET_SPEED_1500W)
                        {
                            refSpeed = SET_TARGET_SPEED_1500W;
                        //MotorStartComplete = 1;
                        }
                    }
                }
            }
            else
            {
                if(MotorRunInCycle==1)
                {
                    if(refSpeed > 100)
                    {            
                        refSpeed -= 100;
                        if(refSpeed <= 100)
                            refSpeed = 20;
                    }                    
                }
                else 
                {
                    if(refSpeed > 200)
                    {            
                        refSpeed -= 100;
                        if(refSpeed <= 200)
                            refSpeed = 200;
                    }
                }
            }
        }         
	measureActualSpeed();
    
    if(++cnt_motor_stop>CNT_10MS*4)
	{
		if(MotorDecActive == 0)measuredSpeed = 0;
		cnt_motor_stop = CNT_10MS*4;
	}
    
    speedControl(); 
}

void __attribute__((interrupt, no_auto_psv)) _T3Interrupt (void)
{
    IFS0bits.T3IF = 0;
    totalTimePeriod += PR3;
}

SHORT getCurrentSectorNo(VOID)
{
    if(PreMotorType == MOTOR_750W)
    {
        sectorTable[0] = INVALID;
        sectorTable[1] = 4;//2;//SECTOR_ONE;
        sectorTable[2] = 2;//4;//SECTOR_THREE;
        sectorTable[3] = 3;//3;//SECTOR_TWO;
        sectorTable[4] = 0;//0;//SECTOR_FIVE;
        sectorTable[5] = 5;//1;//SECTOR_ZERO;
        sectorTable[6] = 1;//5;//SECTOR_FOUR;
        sectorTable[7] = INVALID;
        //sectorTable[8] = {INVALID,SECTOR_ONE,SECTOR_THREE,SECTOR_TWO,SECTOR_FIVE,SECTOR_ZERO,SECTOR_FOUR,INVALID};
    }
    else if(PreMotorType == MOTOR_1500W)
    {
        sectorTable[0] = INVALID;
        sectorTable[1] = SECTOR_ZERO;
        sectorTable[2] = SECTOR_TWO;
        sectorTable[3] = SECTOR_ONE;
        sectorTable[4] = SECTOR_FOUR;
        sectorTable[5] = SECTOR_FIVE;
        sectorTable[6] = SECTOR_THREE;
        sectorTable[7] = INVALID;
//        sectorTable[8] = {INVALID,SECTOR_ZERO,SECTOR_TWO,SECTOR_ONE,SECTOR_FOUR,SECTOR_FIVE,SECTOR_THREE,INVALID};
    }
    hallValue = HALLA_BIT + (HALLB_BIT << 1) + (HALLC_BIT << 2);      
	sector = sectorTable[hallValue];	//Get sector from table
   
    if(sector == INVALID)
    {
        sector = lastSector;       
    }  
    return(sector);
}
                
