gdgly/MoteR_dsPIC33EP32MC204-verx.xx/MotorControl/SpeedController/SpeedController.c
/******************************************************************************
 * _IC1Interrupt
 *
 * The _IC1Interrupt calculates the actual mechanical direction of rotation of 
 * the motor, and adjust the Phase variable depending on the sector the rotor is in.
 * The sector is validated in order to avoid any spurious interrupt due to a slow
 * slew rate on the halls inputs due to hardware filtering. For Phase adjustment in
 * CCW, an offset is added to compensate non-symetries in the sine table used.
 *
 * PARAMETER REQ: none
 *
 * RETURNS: none
 *
 * ERRNO: none
 ********************************************************************************/ 
void __attribute__((interrupt, no_auto_psv)) _IC1Interrupt (void)
{
    SHORT currentSector;
	//	Added to handle "offset at upper & lower limit"
    
    IFS0bits.IC1IF = 0;
    
    currentSector = getCurrentSectorNo();
    
    /* This MUST be done for getting around the HW slow rate */
	//	Added check for invalid sector to handle "offset at upper & lower limit"
	if ((currentSector != lastSector) && (sector != INVALID))	
	{         
        if(PreMotorType == MOTOR_750W)
        {
            //if ((currentSector == SECTOR_ZERO) || (currentSector == SECTOR_THREE))       
            if ((currentSector == sectorTable[2]) || (currentSector == sectorTable[5])) 
            {
                 #if (HALL_INC_DIR == CW)
                    currentDirection = CCW;
                    hallCounts++;
                #else
                    currentDirection = CW;
                    hallCounts--;
                #endif   
            }
            else
            {
                #if (HALL_INC_DIR == CW)
                    currentDirection = CW;
                    hallCounts--;
                #else
                    currentDirection = CCW;
                    hallCounts++;
                #endif
            }
            calculatePhaseValue(currentSector);
            lastSector = currentSector; /* Update last sector */
        }
        else if(PreMotorType == MOTOR_1500W)
        {
            if ((currentSector == SECTOR_FIVE) || (currentSector == SECTOR_TWO))
            {
                currentDirection = CW;
                #if (HALL_INC_DIR == CW)
                    hallCounts++;
                #else
                    hallCounts--;
                #endif
            }
            else
            {
                currentDirection = CCW;
                #if (HALL_INC_DIR == CW)
                    hallCounts--;
                #else
                    hallCounts++;
                #endif
            }
            calculatePhaseValue(currentSector);
            lastSector = currentSector;
        }
    }
}


/******************************************************************************
 * _IC2Interrupt
 *
 * The _IC2Interrupt calculates the actual period between hall effect sensor  
 * transitions and it calculates the actual mechanical direction of rotation of 
 * the motor, and adjust the Phase variable depending on the sector the rotor is in.
 * The sector is validated in order to avoid any spurious interrupt due to a slow
 * slew rate on the halls inputs due to hardware filtering. For Phase adjustment in
 * CCW, an offset is added to compensate non-symetries in the sine table used.
 *
 * PARAMETER REQ: none
 *
 * RETURNS: none
 *
 * ERRNO: none
 ********************************************************************************/ 
void __attribute__((interrupt, no_auto_psv)) _IC2Interrupt (void)
{
	SHORT currentSector;
    
	
	//	Added to handle "offset at upper & lower limit"	
    
    IFS0bits.IC2IF = 0;
    
    currentSector = getCurrentSectorNo();
     
    /* This MUST be done for getting around the HW slow rate */
	//	Added check for invalid sector to handle "offset at upper & lower limit"
	if ((currentSector != lastSector) && (sector != INVALID))
	{          
        T3CONbits.TON = 0;
        totalTimePeriod += TMR3;
		TMR3 = 0;
		T3CONbits.TON = 1;
		hall2Triggered = 1;
                
		/* Motor current direction is computed based on sector */        
        if(PreMotorType == MOTOR_750W)
        {
            //if ((currentSector == SECTOR_FIVE) || (currentSector == SECTOR_TWO))    
            if ((currentSector == sectorTable[3]) || (currentSector == sectorTable[4])) 
            {
                 #if (HALL_INC_DIR == CW)
                    currentDirection = CCW;
                    hallCounts++;
                #else
                    currentDirection = CW;
                    hallCounts--;
                #endif   
            }
            else
            {
                #if (HALL_INC_DIR == CW)
                    currentDirection = CW;
                    hallCounts--;
                #else
                    currentDirection = CCW;
                    hallCounts++;
                #endif
            }
            calculatePhaseValue(currentSector);
            lastSector = currentSector; /* Update last sector */
        }
        else if(PreMotorType == MOTOR_1500W)
        {            
			if ((currentSector == SECTOR_FOUR) || (currentSector == SECTOR_ONE))
            {
                currentDirection = CW;
                #if (HALL_INC_DIR == CW)
                    hallCounts++;
                #else
                    hallCounts--;
                #endif
            }
            else
            {
                currentDirection = CCW;
                #if (HALL_INC_DIR == CW)
                    hallCounts--;
                #else
                    hallCounts++;
                #endif
            }
            calculatePhaseValue(currentSector);
            lastSector = currentSector;
        }
    }
}

/******************************************************************************
 * _IC3Interrupt
 *
 * The _IC3Interrupt calculates the actual mechanical direction of rotation of 
 * the motor, and adjust the Phase variable depending on the sector the rotor is in.
 * The sector is validated in order to avoid any spurious interrupt due to a slow
 * slew rate on the halls inputs due to hardware filtering. For Phase adjustment in
 * CCW, an offset is added to compensate non-symetries in the sine table used.
 *
 * PARAMETER REQ: none
 *
 * RETURNS: none
 *
 * ERRNO: none
 ********************************************************************************/ 
void __attribute__((interrupt, no_auto_psv)) _IC3Interrupt (void)
{
    SHORT currentSector;
	
	//	Added to handle "offset at upper & lower limit"	
    
