gdgly/MoteR_dsPIC33EP32MC204-verx.xx/MotorControl/SpeedController/SpeedController.c
    IFS2bits.IC3IF = 0;
    
    currentSector = getCurrentSectorNo();    
     
    /* This MUST be done for getting around the HW slow rate */
	//	Added check for invalid sector to handle "offset at upper & lower limit"
	if ((currentSector != lastSector) && (sector != INVALID))
	{               
        if(PreMotorType == MOTOR_750W)
        {
            //if ((currentSector == SECTOR_ONE) || (currentSector == SECTOR_FOUR))    
            if ((currentSector == sectorTable[1]) || (currentSector == sectorTable[6]))
            {
                 #if (HALL_INC_DIR == CW)
                    currentDirection = CCW;
                    hallCounts++;
                #else
                    currentDirection = CW;
                    hallCounts--;
                #endif   
            }
            else
            {
                #if (HALL_INC_DIR == CW)
                    currentDirection = CW;
                    hallCounts--;
                #else
                    currentDirection = CCW;
                    hallCounts++;
                #endif
            }
            calculatePhaseValue(currentSector);
            lastSector = currentSector; /* Update last sector */
        }
        else if(PreMotorType == MOTOR_1500W)
        {
			if ((currentSector == SECTOR_ZERO) || (currentSector == SECTOR_THREE))
            {
                currentDirection = CW;
                #if (HALL_INC_DIR == CW)
                    hallCounts++;
                #else
                    hallCounts--;
                #endif
            }
            else
            {
                currentDirection = CCW;
                #if (HALL_INC_DIR == CW)
                    hallCounts--;
                #else
                    hallCounts++;
                #endif
            }
            calculatePhaseValue(currentSector);
            lastSector = currentSector;
        }
	}
}

#ifdef USE_PHASE_INC_AND_CORRECTION
VOID calculatePhaseValue(WORD sectorNo)
{   
   
    if(PreMotorType == MOTOR_750W)
    {
        phaseOffsetCW = PHASE_OFFSET_CW_750W;
        phaseOffsetCCW = PHASE_OFFSET_CCW_750W;
    }
    else if(PreMotorType == MOTOR_1500W)
    {
//        phaseOffsetCW = PHASE_OFFSET_CW_1500W;
//        phaseOffsetCCW = PHASE_OFFSET_CCW_1500W;
            if(measuredSpeed >= 500)
            {    
                if(requiredDirection == CW)
                {
                    if(phaseOffsetCW < PHASE_OFFSET_CW_MAX_1500W)
                        phaseOffsetCW  += PHASE_OFFSET_INC_STEP_1500W;
                    if(phaseOffsetCW >= PHASE_OFFSET_CW_MAX_1500W)
                        phaseOffsetCW = PHASE_OFFSET_CW_MAX_1500W;  
                }
                else if(requiredDirection == CCW)
                {
                    if(phaseOffsetCCW > PHASE_OFFSET_CCW_MAX_1500W)
                        phaseOffsetCCW  -= PHASE_OFFSET_INC_STEP_1500W;
                    if(phaseOffsetCCW <= PHASE_OFFSET_CCW_MAX_1500W)
                        phaseOffsetCCW = PHASE_OFFSET_CCW_MAX_1500W;
                }
            }
            else
            {
                if(phaseOffsetCW > PHASE_OFFSET_CW_def_1500W)
                    phaseOffsetCW -= PHASE_OFFSET_DEC_STEP_1500W;
                if(phaseOffsetCW <= PHASE_OFFSET_CW_def_1500W)
                    phaseOffsetCW = PHASE_OFFSET_CW_def_1500W;
                if(phaseOffsetCCW < PHASE_OFFSET_CCW_def_1500W)
                    phaseOffsetCCW += PHASE_OFFSET_DEC_STEP_1500W;
                if(phaseOffsetCCW >= PHASE_OFFSET_CCW_def_1500W)
                    phaseOffsetCCW = PHASE_OFFSET_CCW_def_1500W;
            }        
    }
    #if 1        
    /* Motor commutation is actually based on the required direction, not */
    /* the current dir. This allows driving the motor in four quadrants */    
    if(((controlOutput >= 0) && (requiredDirection == CW)) || ((controlOutput < 0) && (requiredDirection == CCW)))
    {
        tmpQu = __builtin_divmodud((DWORD)sectorNo, (WORD)SECTOR_END, &tmpRe);
        //Use phase offset calculation only when shutter moving up and DC injection not applied
    //    if((requiredDirection == CW) && (!rampStatusFlags.rampDcInjectionOn))
    //        phaseCopy = phase = phaseValues[tmpRe] + phaseOffsetCW;
    //    else
			phaseCopy = phase = phaseValues[tmpRe] + phaseOffsetCW;// + phaseValue;
//        if((requiredDirection == CW) && (!rampStatusFlags.rampDcInjectionOn))
//            phaseCopy = phase = phaseValues[tmpRe] + (phaseOffsetCW + phaseValue);
//        else
//			phaseCopy = phase = phaseValues[tmpRe] + phaseOffsetCW;
        
        phaseIncFlg = PHASE_INCREMENT_FLAG;
    }
    else if(((controlOutput >= 0) && (requiredDirection == CCW)) || ((controlOutput < 0) && (requiredDirection == CW)))
    {
        /* For CCW an offset must be added to compensate difference in */
        /* symmetry of the sine table used for CW and CCW */
        tmpQu = __builtin_divmodud((DWORD)(sectorNo + SECTOR_THREE), (WORD)SECTOR_END, &tmpRe);
        //Use phase offset calculation only when shutter moving up
    //    if((requiredDirection == CW) && (!rampStatusFlags.rampDcInjectionOn))
    //        phaseCopy = phase = phaseValues[tmpRe]+ (phaseOffsetCCW - phaseValue);
    //    else
            phaseCopy = phase = phaseValues[tmpRe] + phaseOffsetCCW;// + phaseValue;
//        if((requiredDirection == CW) && (!rampStatusFlags.rampDcInjectionOn))
//            phaseCopy = phase = phaseValues[tmpRe]+ (phaseOffsetCCW - phaseValue);
//        else
//            phaseCopy = phase = phaseValues[tmpRe]+ phaseOffsetCCW;
        
        
        phaseIncFlg = PHASE_DECREMENT_FLAG;
    }
    #else
    if (requiredDirection == CW)
	{
        phaseCopy = phase = phaseValues[sectorNo] + 2002;
        phaseIncFlg = PHASE_INCREMENT_FLAG;
	}
	else
	{
        // For CCW an offset must be added to compensate difference in 
        // symmetry of the sine table used for CW and CCW
		phaseCopy = phase = phaseValues[(sectorNo + 3) % 6] + 9828; //+ phaseValue;//+ PhaseOffset;
        phaseIncFlg = PHASE_DECREMENT_FLAG;
	}
    #endif
    
