gdgly/MoteR_dsPIC33EP32MC204-verx.xx/MotorControl/SpeedController/SpeedController.c
}
#else
VOID calculatePhaseValue(WORD sectorNo)
{   
    /* Motor commutation is actually based on the required direction, not */
    /* the current dir. This allows driving the motor in four quadrants */    
    if(((controlOutput >= 0) && (requiredDirection == CW)) || ((controlOutput < 0) && (requiredDirection == CCW)))
    {
        tmpQu = __builtin_divmodud((DWORD)sector, (WORD)SECTOR_END, &tmpRe);
        phase = phaseValues[tmpRe] + phaseOffsetCW;        
    }
    else if(((controlOutput >= 0) && (requiredDirection == CCW)) || ((controlOutput < 0) && (requiredDirection == CW)))
    {
        /* For CCW an offset must be added to compensate difference in */
        /* symmetry of the sine table used for CW and CCW */
        tmpQu = __builtin_divmodud((DWORD)(sector + SECTOR_THREE), (WORD)SECTOR_END, &tmpRe);
        phaseCopy = phase = phaseValues[tmpRe]+ phaseOffsetCCW;
    }
}
#endif
/******************************************************************************
 * measureActualSpeed
 *
 * The measureActualSpeed calculates actual speed of motor from the hall sensor 
 * transistions period. it applies low pass filter to remove noise component.
 *
 * PARAMETER REQ: none
 *
 * RETURNS: none
 *
 * ERRNO: none
 ********************************************************************************/ 
VOID measureActualSpeed(VOID)
{
    if(hall2Triggered)
    {
        period = totalTimePeriod;
        totalTimePeriod = 0;
        hall2Triggered = 0;
        cnt_motor_stop = 0;
    }
    if(PreMotorType == MOTOR_750W)
    {
        if (period < MINPERIOD_750W)  
            period = MINPERIOD_750W;
        else if (period > MAXPERIOD_750W)
            period = MAXPERIOD_750W;
    }
    else if(PreMotorType == MOTOR_1500W)
    {
        if (period < MINPERIOD_1500W)  
            period = MINPERIOD_1500W;
        else if (period > MAXPERIOD_1500W)
            period = MAXPERIOD_1500W;
    }
    
	periodStateVar+= ((period - periodFilter)*(periodFilterConstant));
	periodFilter = periodStateVar>>15;
    if(PreMotorType == MOTOR_750W)
        measuredSpeed = __builtin_divud(SPEED_RPM_CALC_750W,periodFilter);
    else if(PreMotorType == MOTOR_1500W)
        measuredSpeed = __builtin_divud(SPEED_RPM_CALC_1500W,periodFilter);
    measuredSpeed_bak=measuredSpeed;
    phaseInc = __builtin_divud(PHASE_INC_CALC,periodFilter);
//    phaseIncPerSec = __builtin_muluu(measuredSpeed,655);
//    phaseInc = __builtin_divud(phaseIncPerSec,1000);
    
    
    register int a_reg asm("A");
    a_reg = __builtin_mpy(MAX_PH_ADV,SPD_CAL_FOR_PHASEADVANCE , 0,0,0,0,0,0);//SPD_CAL_FOR_PHASEADVANCE
    PhaseAdvance = __builtin_sac(a_reg,0);
    if(requiredDirection == CCW)
        PhaseAdvance = -PhaseAdvance;
        
}

VOID speedControl(VOID) 
{   
    speedPIparms.qInRef = refSpeed;
    speedPIparms.qInMeas = measuredSpeed;
    
    if(PreMotorType == MOTOR_1500W)
        if(requiredDirection == CW)
        {
            speedPIparms.qOutMax = currentLimitClamp;
            speedPIparms.qOutMin = -(currentLimitClamp);
        }
        else
        {
            speedPIparms.qOutMax = currentLimitClamp;
            speedPIparms.qOutMin = -(currentLimitClamp);
        }
    else if(PreMotorType == MOTOR_750W)
    {
        speedPIparms.qOutMax = currentLimitClamp;
        speedPIparms.qOutMin = -(currentLimitClamp);  
    }
        calcPiNew(&speedPIparms);
        
        if(flags.speedControl)
            controlOutput = speedPIparms.qOut;
    
    //calculate percentage duty
    ctrlOpPercent = __builtin_divud(((unsigned long)controlOutput*100),MAX_SPEED_PI);
}



/******************************************************************************
 * initSpeedControllerVariables
 *
 * The initSpeedControllerVariables inititializes all the variables used by 
 * speed control mode.
 *
 * PARAMETER REQ: none
 *
 * RETURNS: none
 *
 * ERRNO: none
 ********************************************************************************/ 
VOID intitSpeedController(VOID)
{ 
    
    hall2Triggered = 0;
    totalTimePeriod = 0;
    measuredSpeed = 0; 
    refSpeed = 200;
    
    PhaseAdvance = 0;
    
    if(PreMotorType == MOTOR_750W)
    {
        controlOutput = 0;
        period = MAXPERIOD_750W;
        periodFilter = MAXPERIOD_750W;
        periodFilterConstant = PERIOD_FILTER_CONST;
        periodStateVar = ((DWORD)MAXPERIOD_750W << 15);
        phaseInc = __builtin_divud(PHASE_INC_CALC, periodFilter);
    }
    else if(PreMotorType == MOTOR_1500W)
    {
        controlOutput = 0;
        period = MAXPERIOD_1500W;
        periodFilter = MAXPERIOD_1500W;
        periodFilterConstant = PERIOD_FILTER_CONST;
        periodStateVar = ((DWORD)MAXPERIOD_1500W << 15);
        phaseInc = __builtin_divud(PHASE_INC_CALC, periodFilter);
    }
    
    //speedError = 0;
    tmpQu = 0;
    tmpRe = 0;
    
    if(PreMotorType == MOTOR_750W)
    {
        sectorTable[0] = INVALID;
        sectorTable[1] = SECTOR_ONE;
        sectorTable[2] = SECTOR_THREE;
        sectorTable[3] = SECTOR_TWO;
        sectorTable[4] = SECTOR_FIVE;
        sectorTable[5] = SECTOR_ZERO;
        sectorTable[6] = SECTOR_FOUR;
        sectorTable[7] = INVALID;
//        sectorTable[8] = {INVALID,SECTOR_ONE,SECTOR_THREE,SECTOR_TWO,SECTOR_FIVE,SECTOR_ZERO,SECTOR_FOUR,INVALID};
    }
    else if(PreMotorType == MOTOR_1500W)
    {
        sectorTable[0] = INVALID;
        sectorTable[1] = SECTOR_ZERO;
        sectorTable[2] = SECTOR_TWO;
        sectorTable[3] = SECTOR_ONE;
        sectorTable[4] = SECTOR_FOUR;
        sectorTable[5] = SECTOR_FIVE;
        sectorTable[6] = SECTOR_THREE;
        sectorTable[7] = INVALID;
//        sectorTable[8] = {INVALID,SECTOR_ZERO,SECTOR_TWO,SECTOR_ONE,SECTOR_FOUR,SECTOR_FIVE,SECTOR_THREE,INVALID};
    }

    hallValue = HALLA_BIT + (HALLB_BIT << 1) + (HALLC_BIT << 2);    
	sector = sectorTable[hallValue];	//Get sector from table
    lastSector = sector;
    calculatePhaseValue(sector);

    if(PreMotorType == MOTOR_750W)
    {
        if(requiredDirection == CW)
        {
//            initPiNew(&speedPIparms,P_SPEED_PI_CW_750W,I_SPEED_PI_CW_750W,C_SPEED_PI,currentLimitClamp,-(currentLimitClamp),0);
            initPiNew(&speedPIparms,P_SPEED_PI_CW_750W,I_SPEED_PI_CW_750W,C_SPEED_PI,5000,-5000,0);
        }
        else
        {
            initPiNew(&speedPIparms,P_SPEED_PI_CCW_750W,I_SPEED_PI_CCW_750W,C_SPEED_PI,5000,-5000,0);
        }
    }
    else if(PreMotorType == MOTOR_1500W)
    {
        if(requiredDirection == CW)
        {
            initPiNew(&speedPIparms,P_SPEED_PI_CW_1500W,I_SPEED_PI_CW_1500W,C_SPEED_PI,15000,-15000,0);
        }
        else
        {
            initPiNew(&speedPIparms,P_SPEED_PI_CCW_1500W,I_SPEED_PI_CCW_1500W,C_SPEED_PI,15000,-15000,0);
        }
    }

}


